Revit 2027 API
BuiltInFailures.CurtainWallFailures.AllGridSegmentsRemoved Property
 Curtain grid lines must have at least one segment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AllGridSegmentsRemoved { get; }
Public Shared ReadOnly Property AllGridSegmentsRemoved As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AllGridSegmentsRemoved {
	FailureDefinitionId^ get ();
}
static member AllGridSegmentsRemoved : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace